# Easy

### Step 1. Import the necessary libraries to visualize the given dataset

In [1]:
# Load the Pandas libraries with alias 'pd' 
import pandas as pd

### Step 2. Read drinks.csv and Assign it to a variable called drinks.

In [2]:
drinks = pd.read_csv("drinks.csv")

print(drinks)

         country  beer_servings  spirit_servings  wine_servings  \
0    Afghanistan              0                0              0
1        Albania             89              132             54
2        Algeria             25                0             14
3        Andorra            245              138            312
4         Angola            217               57             45
..           ...            ...              ...            ...
188    Venezuela            333              100              3
189      Vietnam            111                2              1
190        Yemen              6                0              0
191       Zambia             32               19              4
192     Zimbabwe             64               18              4

     total_litres_of_pure_alcohol continent
0                             0.0        AS
1                             4.9        EU
2                             0.7        AF
3                            12.4        EU
4                             5.9        AF
..                            ...       ...
188                           7.7        SA
189                           2.0        AS
190                           0.1        AS
191                           2.5        AF
192                           4.7        AF

[193 rows x 6 columns]

### Step 3. Which continent drinks more beer on average?

In [3]:
continent_group = drinks.groupby(by='continent', as_index=False, sort=False).agg({'beer_servings':"mean"})
continent_group.sort_values("beer_servings").iloc[-1]

continent                EU
beer_servings    193.777778
Name: 1, dtype: object

### Step 4. For each continent print the statistics for wine consumption.

In [57]:
continent_group = drinks.groupby('continent').agg({'wine_servings':'describe'})
continent_group

          wine_servings                                                   \
                  count        mean        std  min   25%    50%     75%
continent
AF                 53.0   16.264151  38.846419  0.0   1.0    2.0   13.00
AS                 44.0    9.068182  21.667034  0.0   0.0    1.0    8.00
EU                 45.0  142.222222  97.421738  0.0  59.0  128.0  195.00
OC                 16.0   35.625000  64.555790  0.0   1.0    8.5   23.25
SA                 12.0   62.416667  88.620189  1.0   3.0   12.0   98.50


             max
continent
AF         233.0
AS         123.0
EU         370.0
OC         212.0
SA         221.0

### Step 5. Print the mean alcohol consumption per continent for every column

In [155]:
continent_group = drinks.groupby(by='continent', as_index=False, sort=False).mean()
continent_group

,continent,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,AS,37.045455,60.840909,9.068182,2.170455
1,EU,193.777778,132.555556,142.222222,8.617778
2,AF,61.471698,16.339623,16.264151,3.007547
3,SA,175.083333,114.750000,62.416667,6.308333
4,OC,89.687500,58.437500,35.625000,3.381250

### Step 6. Print the median alcohol consumption per continent for every column

In [157]:
continent_group = drinks.groupby(by='continent', as_index=False, sort=False).median()
continent_group

,continent,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,AS,17.5,16.0,1.0,1.20
1,EU,219.0,122.0,128.0,10.00
2,AF,32.0,3.0,2.0,2.30
3,SA,162.5,108.5,12.0,6.85
4,OC,52.5,37.0,8.5,1.75

### Step 7. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [88]:
drinks.groupby(by="continent", as_index=False, sort=False)["wine_servings"].agg(["mean", "median", "max"])

                 mean  median  max
continent
AS           9.068182     1.0  123
EU         142.222222   128.0  370
AF          16.264151     2.0  233
SA          62.416667    12.0  221
OC          35.625000     8.5  212